Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/contracts_of_employment/change_job_contract.html.txt.tmx
Source language: en
Languages: ga

source: Changes to your contract of employment
ga: Athruithe ar do chonradh fostaíochta

source: Changes to your contract of employment can occur due to a change in the law, but otherwise, changes must be agreed between your employer and yourself
ga: Is féidir le hathruithe a tharlú ar do chonradh fostaíochta mar gheall ar athrú ar an dlí, ach seachas sin, ní mór athruithe a chomhaontú idir d’fhostóir agus tú féin

source: Neither party can unilaterally decide to change the contract
ga: Ní féidir le ceachtar páirtí cinneadh aontaobhach a dhéanamh an conradh a athrú

source: This requirement for both the employer's and the employee's consent to changes in the terms of the contract is part of contract law
ga: Is cuid den dlí a bhaineann le conarthaí é gur gá toiliú an fhostóra agus an fhostaí araon a fháil le hathruithe a dhéanamh ar théarmaí an chonartha

source: This principle is not affected by the Terms of Employment (Information) Acts 1994-2014 which sets out the procedures for the employer informing the employee of any changes to the statement of the terms of employment
ga: Ní dhéanann Achtanna um Théarmaí Fostaíochta (Faisnéis) 1994-2014 difear don phrionsabal sin ar Acht é ina leagtar amach nósanna imeachta maidir leis an bhfostóir do chur aon athruithe ar ráiteas na dtéarmaí fostaíochta in iúl don fhostaí

source: Where the law introduces changes into your contract of employment, for example, by extending the statutory period of maternity leave, then both you and your employer must comply with the law
ga: Sa chás go dtugann an dlí athruithe i do chonradh isteach, trí shíneadh na tréimhse reachtúla um shaoire mháithreachais mar shampla, ní mór duit féin agus do d'fhostóir cloí leis an dlí dá réir

source: The nature of your job may change, so that you are doing a different job for the same employer
ga: D’fhéadfadh cineál d’oibre a athrú, ionas go mbíonn tú i mbun cúraim éagsúil don fhostóir céanna

source: Such a major change will probably also result in changes to your terms and conditions of employment
ga: Ba dhócha go dtiocfadh athruithe ar do théarmaí agus coinníollacha fostaíochta de bharr mhórathrú den chineál sin

source: Unless your contract already allows certain changes to be introduced, you or your employer cannot introduce change unilaterally
ga: Mura gceadaíonn do chonradh d’athruithe cheana féin, ní féidir leat féin ná d’fhostóir athrú a dhéanamh go haontaobhach

source: There must be agreement between the parties
ga: Ní mór comhaontú bheith idir an dá pháirtí

source: Where such an agreement is reached, you must be given the details of change(s) in writing within 1 month of their coming into operation
ga: Tar éis comhaontú mar sin a shroicheadh, ní mór mionsonraí na n-athruithe a thabhairt duit i scríbhinn laistigh de mhí tar éis a bhfeidhmithe

source: Contractual terms and work practices
ga: Téarmaí conartha agus cleachtais oibre

source: Legally there is a distinction between the terms in your contract of employment and work practices
ga: Tá idirdhealú idir na téarmaí i do chonradh fostaíochta agus cleachtais oibre

source: Contractual terms include pay, hours of work, sick pay and pension scheme
ga: Áirítear le téarmaí conartha pá, uaireanta oibre, pá breoiteachta agus scéim pinsean

source: All of your contractual terms may not be in the written statement of your terms and conditions of employment
ga: D’fhéadfadh nach n-áireofar an t-iomlán do théarmaí chonartha sa ráiteas scríofa ráiteas scríofa do théarmaí agus coinníollacha fhostaíochta

source: Some of your contractual terms could be in your staff handbook, a pension scheme booklet or a collective agreement
ga: D’fhéadfadh roinnt do théarmaí conartha bheith i do lámhleabhar foirne, lámhleabhar scéime pinsin nó comhaontú comhchoiteann

source: You can read more about contractual terms in our document on contract of employment
ga: Tá tuilleadh eolas maidir le téarmaí conartha inár ndoiciméad faoi chonradh fostaíochta

source: Changes to these terms must be agreed between you and your employer
ga: Ní mór athruithe ar na téarmaí seo a chomhaontú idir d’fhostóir agus tú féin

source: Work practices can include breaks and rostering, for example
ga: Áirítear le cleachtais oibre sosanna agus uainchláir, mar shampla

source: Details of these may also be in your staff handbook and your employer may change these work practices without your consent
ga: D’fhéadfadh na sonraí seo bheith i do lámhleabhar foirne agus is féidir le d’fhostóir iad a athrú gan aon ghá do thoilithe

source: It is considered reasonable for an employer to update work practices or processes to save money or increase efficiency
ga: Measfaí mar réasúnta má athraíonn an fostóir cleachtais oibre chun airgead a shábháil nó éifeachtúlacht a mhéadu

source: Being asked to reduce your pay or hours of work
ga: Nuair a iarrtar ort d'uaireanta oibre a laghdú

source: When your employer has a downturn in business or there is less work for you to do, your employer may ask you to take a pay cut or to work fewer hours
ga: Nuair atá cor chun donais i gcúrsaí gnó ag fostóir nó má tá laghdú ar am méid oibre atá ar fáil duit, d'fhéadfadh fostóir iarraidh ort laghdú pá a thógáil nó níos lú uaireanta a oibriú

source: You should consider this request very carefully
ga: Caithfidh tú iarratas an fhostóra a bhreithniú go cúramach

source: If your employer's business activity is reduced, this may mean that if you don’t accept a reduction in your working hours or pay you may lose your job due to redundancy
ga: Má tá gníomhaíocht gnó d’fhostóír laghdaithe, agus mura nglacann tú le huaireanta oibre nó pá laghdaithe, d'fhéadfá do phost a chailliúint trí iomarcaíocht

source: The legislation covering notification of changes to your contract is set out in Section 5 of the Terms of Employment (Information) Acts 1994–2014
ga: An reachtaíocht a bhaineann le fógairt athruithe i do chonradh, tá sí le fáil in Alt 5 na hAchtanna um Théarmaí Fostaíochta (Faisnéis) 1994-2014

source: Essentially, whenever a change is made or occurs in any part of the contract furnished by an employer, the employer shall notify the employee in writing of the nature and date of the change as soon as may be afterwards
ga: Go bunúsach, aon uair a dhéantar nó a tharlaíonn athrú ar aon chuid den chonradh a thug an fostóir duit, fógróidh an fostóir cineál agus dáta an athraithe i scríbhinn don fhostaí chomh luath agus is féidir ina dhiaidh sin

source: They must notify the employee however not later than:
ga: Ní mór dóibh é a fhógairt don fhostaí tráth nach deanaí ná:

source: • One month after the change takes effect, or
ga: • mí amháin tar éis don athrú teacht i bhfeidhm, nó

source: • Where the change is consequent on the employee being required to work outside the State for a period of more than 1 month, the time of the employee's departure
ga: • sa chás go dtarlaíonn an t-athrú tar éis don fhostaí a bheith faoi iallach obair lasmuigh den Stát ar feadh tréimhse níos mó ná mí amháin, tráth cothrom imeacht an fhostaí

source: This Act also sets out what terms in your contract must be put in writing. (For example, your name, job title, company address, date you commenced employment, etc.)
ga: Leagtar síos san Acht seo freisin na téarmaí i do chonradh nach mór a chur i scríbhinn (mar shampla, d’ainm, teideal do phoist, seoladh an chomhlachta, an dáta ar ar thosaigh tú, srl.)

source: The requirement that you receive a written statement of your terms of employment is set down under Section 3 of the Terms of Employment (Information) Acts 1994-2014
ga: An riachtanas a bhaineann le go bhfaighfeá conradh scríofa, leagtar síos é in Alt 3 na hAchtanna um Théarmaí Fostaíochta (Faisnéis) 1994-2014

source: If you do not receive the required notification of a change to your statement of terms of employment, you should first raise this issue with your employer or the personnel department of your company
ga: Mura bhfaighidh tú an fógra is gá maidir le hathrú ar do ráiteas téarmaí fostaíochta, ba chóir duit an tsaincheist sin a ardú ar dtús le d’fhostóir nó le rannóg phearsanra do chuideachta

source: If you are a member of a trade union, you may also raise this with your local representative
ga: Más ball de cheardchumann tú, féadfaidh tú an tsaincheist a ardú le d’ionadaí áitiúil

source: If you still fail to receive a notification of change to your contract, and have tried raising this issue with your employer, you may make a complaint under the Terms of Employment (Information) Acts 1994-2014 – see 'Complaints' below
ga: Mura n-éireoidh leat fós fógra a fháil maidir le hathrú ar do chonradh, is féidir leat gearán a dhéanamh faoin Acht faoin Achtanna um Théarmaí Fostaíochta (Faisnéis) 1994-2014 - féach 'Gearáin' thíos

source: If your employer makes a significant change in your contract for example by reducing your pay, you should ask your employer to give you written details of this proposed change to your contract of employment including a review date
ga: Má dhéanann d’fhostóir athrú suntasach ar do chonradh nach dtoilíonn tú leis, mar shampla trí do phá a laghdú, ba chóir duit ceist a chur ar d’fhostóír chun sonraí scríofa den athrú molta ar do chonartha fostaíochta, dáta athbhreithniúcháin san áireamh

source: You should respond to this in writing and if you are proposing to accept the change, you should stress that your acceptance is temporary
ga: Ba chóir duit freagra scríofa a thabhairt agus, má molann tú leis an athrú a glacadh, caithfidh tú cur i bhfios go láidir go mbeadh do ghlacadh sealadach

source: At the review date the change to your contract can be reconsidered and you could ask to return to the original terms and conditions of your contract
ga: Nuair a mbeadh an athrú ar do chonartha fostaíochta athbhreithnithe ag an dáta sin, is féidir iarratas a dhéanamh chun fill ar do bunthéarmaí agus coinníollacha

source: If you do not agree and say you wish to continue working as before your employer may decide to make you redundant
ga: Mura n-aontaíonn tú leis an laghdú agus más mian leat leanúint ag obair mar roimhe sin, b'fhéidir go gcinnfeadh d’fostóir tú a dhéanamh iomarcach

source: If you are dismissed in this way, you may qualify to bring a claim for unfair dismissal
ga: Má tá tú dífhostaithe ó do chuid fostaíochta, d'fhéadfá bheith incháilithe chun éileamh ar dhífhostú éagórach a dhéanamh

source: Unless your employer can prove there was a genuine redundancy situation and that fair procedures were followed, this dismissal may be found to be unfair
ga: Ceaptar go bhfuil dífhostú éagórach murar féidir le d’fhostóir cúis iomarcaíochta dhílis agus nósanna imeachta maithe a thabhairt leis

source: If your employer insists on reducing your working hours or pay you may also consider that you have no choice but to leave your job and claim unfair dismissal
ga: Má d’áitíonn d'fhostóir uaireanta oibre nó pá a laghdú b'fhéidir nach bhfuil rogha agat ach éirí as agus éileamh a dhéanamh ar toisc go bhfuil téarmaí an chonartha sáraithe ag an bhfostóir

source: This type of dismissal is known as constructive dismissal, because although you left the job, the employer forced you to leave by his/her actions
ga: b’fhéidir go gceapfaidh tú nach bhfuil aon rogha agat ach do phost a fhágáil agus dífhostú éagórach a éileamh

source: Before exercising this option, however, you should always seek detailed legal advice as proving constructive dismissal can often be difficult
ga: Tugtar dífhostú inchiallaithe ar an gcineál sin dífhostaithe ar an ábhar, cé gur fhág tú an post, gur chuir an fostóir ort imeacht mar gheall ar a ghníomhartha/a gníomhartha

source: Alternatively, you could refer the dispute to the Workplace Relations Commission in the hope of resolving the matter, and thus avoid the necessity for you to leave the job
ga: Sula bhfeidhmíonn tú an rogha sin áfach, ba chóir duit i gcónaí comhairle dlí shonraithe a lorg mar go minic bíonn sé deacair dífhostú inchiallaithe a chruthú

source: As the attempts made by the employee to resolve a grievance before resigning are always relevant in an unfair dismissal claim involving constructive dismissal, this may be the wisest course of action
ga: Toisc go mbaineann na hiarrachtaí a dhéanann an fostaí casaoid a réiteach sula n-éiríonn sé/sí as le hábhar i gcónaí in éileamh a bhaineann le dífhostú inchiallaithe, b’fhéidir gurb é sin an beart is ciallmhaire

source: If you are making a complaint to the Workplace Relations Commission, you should do so within 6 months of the dispute or complaint occurring. You must use the online complaint form available on workplacerelations.ie
ga: Má dhéanann tú gearán chuig an gCoimisiún um Chaidreamh san Áit Oibre ba chóir duit an fhoirm ghearáin ar líne nua a úsáid á fáil ar workplacerelations.ie. Ní mór duit gearán a dhéanamh laistigh de 6 mhí

source: The time limit may be extended for up to a further 6 months, but only where there are reasonable circumstances which prevented the complaint being brought within the normal time limit. Where to apply Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Is féidir síneadh ama 6 mhí eile a thabhairt duit ach ní dhéanfar é sin mura bhfuil cúinsí réasúnacha ann a chuir cosc ort an gearán a dhéanamh laistigh den gnáth-thréimhse ama
